#[test]
fn main() {
    let mut x: i32 = 1;
    x = 7;
    let x = x;

    let y = 4;
    // Затінення
    let y = "Я також можу бути прив'язаний до тексту!";

    println!("Success!");
}



//У цьому коді показано затінення змінних у Rust: змінна x спочатку має тип i32 та значення 1, яке змінюється на 7,
// а потім затінюється новою незмінною змінною x зі значенням 7. Також змінна y спочатку отримує значення 4,
// а потім затінюється новою змінною y, яка вже є рядком "Я також можу бути прив'язаний до тексту!".
// Затінення дозволяє перевизначати змінні з новими значеннями та типами без зміни попередніх.