#[test]
fn main() {
    let (mut x, y) = (1, 2);  // Зробимо x змінною

    x += 2;  // Тепер можна змінити значення x

    assert_eq!(x, 3);
    assert_eq!(y, 2);

    println!("Success!");
}



//У цьому коді змінна x оголошується як змінна, що може змінюватися (mut), зі значенням 1, а y — як незмінна
// зі значенням 2. Потім значення x збільшується на 2, і використовуються макроси assert_eq!
// для перевірки, що x дорівнює 3, а y залишається рівним 2. Якщо все правильно, виводиться "Success!".